cask_args appdir: '/Applications'

# taps are Formulaes/commands pulled from a Git repo
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/services'

# brew is used for installing MacOS dependencies/binaries
brew 'ctags'
brew 'bash'
brew 'git'
brew 'git-secrets'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'imagemagick'
brew 'mas'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'zsh'

# cask is used for installing Mac applications
cask 'atom'
cask 'alfred'
cask 'cloud'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'slack'

# mas is used for installing Mac App Store applications
# aka, applications not yet provided through cask

# optional sign in to app store
# you can provide pw here, or be prompted for it durring run time
# mas signin example@mail.com "som3Rand0p@sswOrd'

# mas 'Pixelmator', id: 407963104
# mas 'Sip', id: 507257563
# mas 'Xcode', id: 497799835
