cask_args appdir: '/Applications'

# taps are Formulaes/commands pulled from a Git repo
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/services'

# brew is used for installing MacOS dependencies/binaries
brew 'cmake'
brew 'ctags'
brew 'bash'
brew 'git'
brew 'git-secrets'
brew 'httpie'
brew 'openssl'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'tmux', args: ['reattach-to-user-namespace']
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'z'

# start psql cluster
# brew services start postgresql
