cask_args appdir: '/Applications'

# taps are Formulaes/commands pulled from a Git repo
tap 'homebrew/cask'
tap 'homebrew/services'

# brew is used for installing MacOS dependencies/binaries
brew 'ack'
brew 'awscli'
brew 'cmake'
brew 'ctags'
brew 'bash'
brew 'git'
brew 'git-secrets'
brew 'httpie'
brew 'openssl'
brew 'postgresql'
brew 'redis'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'z'

# start psql cluster
# brew services start postgresql
